# ClearRules Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterFilterElement..::..ClearRules Method
ParameterFilterElement Class See Also
---
Removes all rules from this filter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public void ClearRules()
```

Visual Basic
---
```text
Public Sub ClearRules
```

Visual C++
---
```text
public:
void ClearRules()
```

# See Also
ParameterFilterElement Class
Autodesk.Revit.DB Namespace